-- MySQL dump 10.13  Distrib 8.0.22, for Linux (x86_64)
--
-- Host: localhost    Database: vk
-- ------------------------------------------------------
-- Server version	8.0.22-0ubuntu0.20.04.3

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8mb4 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `communities`
--

DROP TABLE IF EXISTS `communities`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `communities` (
  `id` bigint unsigned NOT NULL AUTO_INCREMENT COMMENT 'Р�РґРµРЅС‚РёС„РёРєР°С‚РѕСЂ СЃСЂРѕРєРё',
  `name` varchar(150) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL COMMENT 'РќР°Р·РІР°РЅРёРµ РіСЂСѓРїРїС‹',
  `created_at` datetime DEFAULT CURRENT_TIMESTAMP COMMENT 'Р’СЂРµРјСЏ СЃРѕР·РґР°РЅРёСЏ СЃС‚СЂРѕРєРё',
  `updated_at` datetime DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP COMMENT 'Р’СЂРµРјСЏ РѕР±РЅРѕРІР»РµРЅРёСЏ СЃС‚СЂРѕРєРё',
  PRIMARY KEY (`id`),
  UNIQUE KEY `name` (`name`)
) ENGINE=InnoDB AUTO_INCREMENT=14 DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci COMMENT='Р“СЂСѓРїРїС‹';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `communities`
--

LOCK TABLES `communities` WRITE;
/*!40000 ALTER TABLE `communities` DISABLE KEYS */;
INSERT INTO `communities` VALUES (11,'Популярная музыка','2020-12-28 00:11:43','2020-12-28 00:11:43'),(12,'Экскурсии','2020-12-28 00:11:44','2020-12-28 00:11:44'),(13,'Школа танцев','2020-12-28 00:11:45','2020-12-28 00:11:45');
/*!40000 ALTER TABLE `communities` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `communities_users`
--

DROP TABLE IF EXISTS `communities_users`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `communities_users` (
  `community_id` int unsigned NOT NULL COMMENT 'Ссылка на группу',
  `user_id` int unsigned NOT NULL COMMENT 'Ссылка на пользователя',
  `created_at` datetime DEFAULT CURRENT_TIMESTAMP COMMENT 'Время создания строки',
  PRIMARY KEY (`community_id`,`user_id`) COMMENT 'Составной первичный ключ'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci COMMENT='Участники групп, связь между пользователями и группами';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `communities_users`
--

LOCK TABLES `communities_users` WRITE;
/*!40000 ALTER TABLE `communities_users` DISABLE KEYS */;
INSERT INTO `communities_users` VALUES (11,171,'2020-12-28 00:13:04'),(12,110,'2020-12-28 00:13:04'),(13,197,'2020-12-28 00:13:04');
/*!40000 ALTER TABLE `communities_users` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `contacts`
--

DROP TABLE IF EXISTS `contacts`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `contacts` (
  `id` int unsigned NOT NULL AUTO_INCREMENT COMMENT 'Идентификатор сроки',
  `user_id` int unsigned NOT NULL COMMENT 'Ссылка на профиль пользователя',
  `contact_type` varchar(30) DEFAULT NULL COMMENT 'Тип контакта',
  `contact_info` varchar(1000) DEFAULT NULL COMMENT 'контактная информация',
  `created_at` datetime DEFAULT CURRENT_TIMESTAMP COMMENT 'Время создания строки',
  `updated_at` datetime DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP COMMENT 'Время обновления строки',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=128 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci COMMENT='Контактная информация';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `contacts`
--

LOCK TABLES `contacts` WRITE;
/*!40000 ALTER TABLE `contacts` DISABLE KEYS */;
INSERT INTO `contacts` VALUES (1,134,'email','alfonso.conn@example.org','2020-12-27 23:59:47','2020-12-27 23:59:47'),(2,182,'email','anikolaus@example.com','2020-12-27 23:59:47','2020-12-27 23:59:47'),(3,170,'email','august.von@example.com','2020-12-27 23:59:47','2020-12-27 23:59:47'),(4,124,'email','brenden.altenwerth@example.net','2020-12-27 23:59:47','2020-12-27 23:59:47'),(5,106,'email','briana37@example.com','2020-12-27 23:59:47','2020-12-27 23:59:47'),(6,184,'email','cecilia03@example.org','2020-12-27 23:59:47','2020-12-27 23:59:47'),(7,187,'email','chanel.runte@example.com','2020-12-27 23:59:47','2020-12-27 23:59:47'),(8,181,'email','cheyenne83@example.org','2020-12-27 23:59:47','2020-12-27 23:59:47'),(9,169,'email','cole.libby@example.com','2020-12-27 23:59:47','2020-12-27 23:59:47'),(10,165,'email','corkery.daphne@example.com','2020-12-27 23:59:47','2020-12-27 23:59:47'),(11,110,'email','cummerata.maria@example.org','2020-12-27 23:59:47','2020-12-27 23:59:47'),(12,159,'email','dakota.terry@example.net','2020-12-27 23:59:47','2020-12-27 23:59:47'),(13,156,'email','darrick.o\'conner@example.net','2020-12-27 23:59:47','2020-12-27 23:59:47'),(14,178,'email','destany.ankunding@example.net','2020-12-27 23:59:47','2020-12-27 23:59:47'),(15,136,'email','dion.kuhlman@example.com','2020-12-27 23:59:47','2020-12-27 23:59:47'),(16,123,'email','donnelly.dominic@example.org','2020-12-27 23:59:47','2020-12-27 23:59:47'),(17,185,'email','durgan.vallie@example.org','2020-12-27 23:59:47','2020-12-27 23:59:47'),(18,197,'email','fcarroll@example.org','2020-12-27 23:59:47','2020-12-27 23:59:47'),(19,119,'email','flangworth@example.net','2020-12-27 23:59:47','2020-12-27 23:59:47'),(20,161,'email','gunnar08@example.org','2020-12-27 23:59:47','2020-12-27 23:59:47'),(21,137,'email','gutkowski.terence@example.net','2020-12-27 23:59:47','2020-12-27 23:59:47'),(22,172,'email','hettinger.tina@example.org','2020-12-27 23:59:47','2020-12-27 23:59:47'),(23,195,'email','idaniel@example.com','2020-12-27 23:59:47','2020-12-27 23:59:47'),(24,129,'email','iheller@example.com','2020-12-27 23:59:47','2020-12-27 23:59:47'),(25,143,'email','io\'keefe@example.com','2020-12-27 23:59:47','2020-12-27 23:59:47'),(26,109,'email','jakubowski.carissa@example.net','2020-12-27 23:59:47','2020-12-27 23:59:47'),(27,107,'email','jameson76@example.com','2020-12-27 23:59:47','2020-12-27 23:59:47'),(28,199,'email','jblock@example.com','2020-12-27 23:59:47','2020-12-27 23:59:47'),(29,177,'email','jerrod12@example.net','2020-12-27 23:59:47','2020-12-27 23:59:47'),(30,117,'email','jillian57@example.com','2020-12-27 23:59:47','2020-12-27 23:59:47'),(31,127,'email','johnson.alexie@example.net','2020-12-27 23:59:47','2020-12-27 23:59:47'),(32,183,'email','kuphal.rosario@example.com','2020-12-27 23:59:47','2020-12-27 23:59:47'),(33,126,'email','kuvalis.emma@example.org','2020-12-27 23:59:47','2020-12-27 23:59:47'),(34,200,'email','labadie.brain@example.org','2020-12-27 23:59:47','2020-12-27 23:59:47'),(35,171,'email','laverne05@example.org','2020-12-27 23:59:47','2020-12-27 23:59:47'),(36,105,'email','lillie.schmeler@example.org','2020-12-27 23:59:47','2020-12-27 23:59:47'),(37,121,'email','lreichert@example.org','2020-12-27 23:59:47','2020-12-27 23:59:47'),(38,113,'email','lwisoky@example.org','2020-12-27 23:59:47','2020-12-27 23:59:47'),(39,118,'email','mason.rippin@example.com','2020-12-27 23:59:47','2020-12-27 23:59:47'),(40,157,'email','mueller.brionna@example.net','2020-12-27 23:59:47','2020-12-27 23:59:47'),(41,102,'email','ngoodwin@example.com','2020-12-27 23:59:47','2020-12-27 23:59:47'),(42,160,'email','norbert.kirlin@example.net','2020-12-27 23:59:47','2020-12-27 23:59:47'),(43,116,'email','rkassulke@example.com','2020-12-27 23:59:47','2020-12-27 23:59:47'),(44,111,'email','rogahn.breanna@example.org','2020-12-27 23:59:47','2020-12-27 23:59:47'),(45,101,'email','rschultz@example.org','2020-12-27 23:59:47','2020-12-27 23:59:47'),(46,141,'email','rudolph.cruickshank@example.net','2020-12-27 23:59:47','2020-12-27 23:59:47'),(47,158,'email','satterfield.natalia@example.com','2020-12-27 23:59:47','2020-12-27 23:59:47'),(48,164,'email','sawayn.laurel@example.net','2020-12-27 23:59:47','2020-12-27 23:59:47'),(49,120,'email','shania76@example.com','2020-12-27 23:59:47','2020-12-27 23:59:47'),(50,128,'email','sspencer@example.com','2020-12-27 23:59:47','2020-12-27 23:59:47'),(51,135,'email','suzanne02@example.net','2020-12-27 23:59:47','2020-12-27 23:59:47'),(52,152,'email','torrance44@example.org','2020-12-27 23:59:47','2020-12-27 23:59:47'),(53,108,'email','uwehner@example.org','2020-12-27 23:59:47','2020-12-27 23:59:47'),(54,104,'email','vada.rippin@example.org','2020-12-27 23:59:47','2020-12-27 23:59:47'),(55,192,'email','vmorar@example.org','2020-12-27 23:59:47','2020-12-27 23:59:47'),(56,166,'email','vtowne@example.net','2020-12-27 23:59:47','2020-12-27 23:59:47'),(57,133,'email','yjohnston@example.com','2020-12-27 23:59:47','2020-12-27 23:59:47'),(58,101,'phone','0','2020-12-27 23:59:47','2020-12-27 23:59:47'),(59,111,'phone','1','2020-12-27 23:59:47','2020-12-27 23:59:47'),(60,127,'phone','9','2020-12-27 23:59:47','2020-12-27 23:59:47'),(61,184,'phone','15','2020-12-27 23:59:47','2020-12-27 23:59:47'),(62,136,'phone','28','2020-12-27 23:59:47','2020-12-27 23:59:47'),(63,192,'phone','50','2020-12-27 23:59:47','2020-12-27 23:59:47'),(64,126,'phone','52','2020-12-27 23:59:47','2020-12-27 23:59:47'),(65,199,'phone','60','2020-12-27 23:59:47','2020-12-27 23:59:47'),(66,128,'phone','63','2020-12-27 23:59:47','2020-12-27 23:59:47'),(67,109,'phone','65','2020-12-27 23:59:47','2020-12-27 23:59:47'),(68,152,'phone','70','2020-12-27 23:59:47','2020-12-27 23:59:47'),(69,178,'phone','89','2020-12-27 23:59:47','2020-12-27 23:59:47'),(70,157,'phone','91','2020-12-27 23:59:47','2020-12-27 23:59:47'),(71,117,'phone','92','2020-12-27 23:59:47','2020-12-27 23:59:47'),(72,172,'phone','93','2020-12-27 23:59:47','2020-12-27 23:59:47'),(73,169,'phone','113','2020-12-27 23:59:47','2020-12-27 23:59:47'),(74,166,'phone','125','2020-12-27 23:59:47','2020-12-27 23:59:47'),(75,108,'phone','310','2020-12-27 23:59:47','2020-12-27 23:59:47'),(76,137,'phone','318','2020-12-27 23:59:47','2020-12-27 23:59:47'),(77,177,'phone','342','2020-12-27 23:59:47','2020-12-27 23:59:47'),(78,119,'phone','377','2020-12-27 23:59:47','2020-12-27 23:59:47'),(79,161,'phone','384','2020-12-27 23:59:47','2020-12-27 23:59:47'),(80,102,'phone','408','2020-12-27 23:59:47','2020-12-27 23:59:47'),(81,187,'phone','428','2020-12-27 23:59:47','2020-12-27 23:59:47'),(82,118,'phone','433','2020-12-27 23:59:47','2020-12-27 23:59:47'),(83,124,'phone','480','2020-12-27 23:59:47','2020-12-27 23:59:47'),(84,171,'phone','487','2020-12-27 23:59:47','2020-12-27 23:59:47'),(85,181,'phone','541','2020-12-27 23:59:47','2020-12-27 23:59:47'),(86,160,'phone','594','2020-12-27 23:59:47','2020-12-27 23:59:47'),(87,120,'phone','694','2020-12-27 23:59:47','2020-12-27 23:59:47'),(88,197,'phone','758','2020-12-27 23:59:47','2020-12-27 23:59:47'),(89,106,'phone','805','2020-12-27 23:59:47','2020-12-27 23:59:47'),(90,170,'phone','825','2020-12-27 23:59:47','2020-12-27 23:59:47'),(91,129,'phone','847','2020-12-27 23:59:47','2020-12-27 23:59:47'),(92,143,'phone','870','2020-12-27 23:59:47','2020-12-27 23:59:47'),(93,156,'phone','997','2020-12-27 23:59:47','2020-12-27 23:59:47'),(94,159,'phone','42507','2020-12-27 23:59:47','2020-12-27 23:59:47'),(95,165,'phone','199867','2020-12-27 23:59:47','2020-12-27 23:59:47'),(96,141,'phone','225674','2020-12-27 23:59:47','2020-12-27 23:59:47'),(97,113,'phone','392778','2020-12-27 23:59:47','2020-12-27 23:59:47'),(98,121,'phone','434775','2020-12-27 23:59:47','2020-12-27 23:59:47'),(99,195,'phone','491297','2020-12-27 23:59:47','2020-12-27 23:59:47'),(100,134,'phone','545165','2020-12-27 23:59:47','2020-12-27 23:59:47'),(101,104,'phone','561183','2020-12-27 23:59:47','2020-12-27 23:59:47'),(102,133,'phone','595111','2020-12-27 23:59:47','2020-12-27 23:59:47'),(103,158,'phone','639138','2020-12-27 23:59:47','2020-12-27 23:59:47'),(104,107,'phone','724621','2020-12-27 23:59:47','2020-12-27 23:59:47'),(105,200,'phone','748471','2020-12-27 23:59:47','2020-12-27 23:59:47'),(106,123,'phone','781907','2020-12-27 23:59:47','2020-12-27 23:59:47'),(107,164,'phone','782016','2020-12-27 23:59:47','2020-12-27 23:59:47'),(108,182,'phone','817483','2020-12-27 23:59:47','2020-12-27 23:59:47'),(109,185,'phone','818853','2020-12-27 23:59:47','2020-12-27 23:59:47'),(110,110,'phone','920616','2020-12-27 23:59:47','2020-12-27 23:59:47'),(111,135,'phone','946274','2020-12-27 23:59:47','2020-12-27 23:59:47'),(112,183,'phone','964060','2020-12-27 23:59:47','2020-12-27 23:59:47'),(113,116,'phone','903619287','2020-12-27 23:59:47','2020-12-27 23:59:47'),(114,105,'phone','2147483647','2020-12-27 23:59:47','2020-12-27 23:59:47');
/*!40000 ALTER TABLE `contacts` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `friendship`
--

DROP TABLE IF EXISTS `friendship`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `friendship` (
  `user_id` int unsigned NOT NULL COMMENT 'РЎСЃС‹Р»РєР° РЅР° РёРЅРёС†РёР°С‚РѕСЂР° РґСЂСѓР¶РµСЃРєРёС… РѕС‚РЅРѕС€РµРЅРёР№',
  `friend_id` int unsigned NOT NULL COMMENT 'РЎСЃС‹Р»РєР° РЅР° РїРѕР»СѓС‡Р°С‚РµР»СЏ РїСЂРёРіР»Р°С€РµРЅРёСЏ РґСЂСѓР¶РёС‚СЊ',
  `status_id` int unsigned NOT NULL COMMENT 'РЎСЃС‹Р»РєР° РЅР° СЃС‚Р°С‚СѓСЃ (С‚РµРєСѓС‰РµРµ СЃРѕСЃС‚РѕСЏРЅРёРµ) РѕС‚РЅРѕС€РµРЅРёР№',
  `requested_at` datetime DEFAULT CURRENT_TIMESTAMP COMMENT 'Р’СЂРµРјСЏ РѕС‚РїСЂР°РІР»РµРЅРёСЏ РїСЂРёРіР»Р°С€РµРЅРёСЏ РґСЂСѓР¶РёС‚СЊ',
  `confirmed_at` datetime DEFAULT NULL COMMENT 'Р’СЂРµРјСЏ РїРѕРґС‚РІРµСЂР¶РґРµРЅРёСЏ РїСЂРёРіР»Р°С€РµРЅРёСЏ',
  `created_at` datetime DEFAULT CURRENT_TIMESTAMP COMMENT 'Р’СЂРµРјСЏ СЃРѕР·РґР°РЅРёСЏ СЃС‚СЂРѕРєРё',
  `updated_at` datetime DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP COMMENT 'Р’СЂРµРјСЏ РѕР±РЅРѕРІР»РµРЅРёСЏ СЃС‚СЂРѕРєРё',
  PRIMARY KEY (`user_id`,`friend_id`) COMMENT 'РЎРѕСЃС‚Р°РІРЅРѕР№ РїРµСЂРІРёС‡РЅС‹Р№ РєР»СЋС‡'
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci COMMENT='РўР°Р±Р»РёС†Р° РґСЂСѓР¶Р±С‹';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `friendship`
--

LOCK TABLES `friendship` WRITE;
/*!40000 ALTER TABLE `friendship` DISABLE KEYS */;
INSERT INTO `friendship` VALUES (102,199,1,'1972-02-03 07:00:16','1972-02-24 07:00:16','1972-02-03 07:00:16','2020-12-28 00:54:14'),(104,129,1,'1975-08-08 07:52:02','1975-08-29 07:52:02','1975-08-08 07:52:02','2020-12-28 00:54:14'),(108,127,1,'2016-05-26 03:01:28','2016-06-16 03:01:28','2016-05-26 03:01:28','2020-12-28 00:54:14'),(108,152,1,'1983-08-07 20:19:06','1983-08-28 20:19:06','1983-08-07 20:19:06','2020-12-28 00:54:14'),(108,159,3,'2013-07-16 18:54:13','2013-08-06 18:54:13','2013-07-16 18:54:13','2020-12-28 00:54:14'),(109,197,1,'1982-04-21 21:32:42','1982-05-12 21:32:42','1982-04-21 21:32:42','2020-12-28 00:54:14'),(110,187,2,'1982-03-12 16:33:50','1982-04-02 16:33:50','1982-03-12 16:33:50','2020-12-28 00:54:14'),(111,137,3,'2010-03-11 02:00:37','2010-04-01 02:00:37','2010-03-11 02:00:37','2020-12-28 00:54:14'),(113,120,3,'1976-02-06 11:40:40','1976-02-27 11:40:40','1976-02-06 11:40:40','2020-12-28 00:54:14'),(116,123,3,'1986-12-07 11:54:50','1986-12-28 11:54:50','1986-12-07 11:54:50','2020-12-28 00:54:14'),(117,109,2,'1987-03-08 15:40:59','1987-03-29 15:40:59','1987-03-08 15:40:59','2020-12-28 00:54:14'),(117,165,3,'1995-11-21 07:03:42','1995-12-12 07:03:42','1995-11-21 07:03:42','2020-12-28 00:54:14'),(119,169,3,'1982-10-01 03:15:15','1982-10-22 03:15:15','1982-10-01 03:15:15','2020-12-28 00:54:14'),(124,182,1,'1980-11-12 09:11:53','1980-12-03 09:11:53','1980-11-12 09:11:53','2020-12-28 00:54:14'),(126,102,1,'2003-06-17 13:06:39','2003-07-08 13:06:39','2003-06-17 13:06:39','2020-12-28 00:54:14'),(126,124,2,'2015-09-09 10:20:06','2015-09-30 10:20:06','2015-09-09 10:20:06','2020-12-28 00:54:14'),(127,129,3,'2005-04-03 03:50:37','2005-04-24 03:50:37','2005-04-03 03:50:37','2020-12-28 00:54:14'),(128,183,1,'2015-02-28 07:27:05','2015-03-21 07:27:05','2015-02-28 07:27:05','2020-12-28 00:54:14'),(133,160,2,'1997-01-23 19:11:59','1997-02-13 19:11:59','1997-01-23 19:11:59','2020-12-28 00:54:14'),(133,177,2,'2004-12-21 23:23:53','2005-01-11 23:23:53','2004-12-21 23:23:53','2020-12-28 00:54:14'),(134,177,2,'1994-01-11 14:48:30','1994-02-01 14:48:30','1994-01-11 14:48:30','2020-12-28 00:54:14'),(134,192,1,'1988-05-31 03:37:12','1988-06-21 03:37:12','1988-05-31 03:37:12','2020-12-28 00:54:14'),(135,199,2,'1989-06-28 13:06:53','1989-07-19 13:06:53','1989-06-28 13:06:53','2020-12-28 00:54:14'),(137,116,2,'2016-11-01 18:44:49','2016-11-22 18:44:49','2016-11-01 18:44:49','2020-12-28 00:54:14'),(152,107,1,'1988-05-16 13:15:49','1988-06-06 13:15:49','1988-05-16 13:15:49','2020-12-28 00:54:14'),(152,109,1,'1974-01-31 23:24:41','1974-02-21 23:24:41','1974-01-31 23:24:41','2020-12-28 00:54:14'),(157,182,3,'1993-08-02 12:45:19','1993-08-23 12:45:19','1993-08-02 12:45:19','2020-12-28 00:54:14'),(159,127,3,'2008-09-16 20:12:46','2008-10-07 20:12:46','2008-09-16 20:12:46','2020-12-28 00:54:14'),(161,157,3,'1976-03-02 15:55:24','1976-03-23 15:55:24','1976-03-02 15:55:24','2020-12-28 00:54:14'),(161,192,1,'1992-12-07 13:39:10','1992-12-28 13:39:10','1992-12-07 13:39:10','2020-12-28 00:54:14'),(164,169,2,'1988-04-07 07:02:00','1988-04-28 07:02:00','1988-04-07 07:02:00','2020-12-28 00:54:14'),(164,182,2,'1970-09-03 16:47:10','1970-09-24 16:47:10','1970-09-03 16:47:10','2020-12-28 00:54:14'),(165,101,1,'2016-10-17 08:05:14','2016-11-07 08:05:14','2016-10-17 08:05:14','2020-12-28 00:54:14'),(169,133,3,'1996-02-27 15:04:57','1996-03-19 15:04:57','1996-02-27 15:04:57','2020-12-28 00:54:14'),(170,104,3,'2001-06-04 19:54:51','2001-06-25 19:54:51','2001-06-04 19:54:51','2020-12-28 00:54:14'),(170,113,2,'1980-07-03 07:59:38','1980-07-24 07:59:38','1980-07-03 07:59:38','2020-12-28 00:54:14'),(170,123,3,'1971-12-30 11:11:42','1972-01-20 11:11:42','1971-12-30 11:11:42','2020-12-28 00:54:14'),(170,128,3,'2005-02-09 10:49:44','2005-03-02 10:49:44','2005-02-09 10:49:44','2020-12-28 00:54:14'),(181,102,3,'1974-11-03 02:30:29','1974-11-24 02:30:29','1974-11-03 02:30:29','2020-12-28 00:54:14'),(181,118,1,'2011-01-28 18:27:53','2011-02-18 18:27:53','2011-01-28 18:27:53','2020-12-28 00:54:14'),(182,152,1,'2015-10-23 13:02:38','2015-11-13 13:02:38','2015-10-23 13:02:38','2020-12-28 00:54:14'),(183,109,2,'1976-04-10 08:17:06','1976-05-01 08:17:06','1976-04-10 08:17:06','2020-12-28 00:54:14'),(183,111,1,'2011-04-28 08:08:34','2011-05-19 08:08:34','2011-04-28 08:08:34','2020-12-28 00:54:14'),(183,123,2,'1970-09-27 02:01:32','1970-10-18 02:01:32','1970-09-27 02:01:32','2020-12-28 00:54:14'),(185,110,1,'1989-06-28 23:20:57','1989-07-19 23:20:57','1989-06-28 23:20:57','2020-12-28 00:54:14'),(187,133,3,'1983-08-20 15:33:50','1983-09-10 15:33:50','1983-08-20 15:33:50','2020-12-28 00:54:14'),(187,197,3,'1971-08-15 00:06:28','1971-09-05 00:06:28','1971-08-15 00:06:28','2020-12-28 00:54:14'),(192,117,2,'1972-10-01 21:43:49','1972-10-22 21:43:49','1972-10-01 21:43:49','2020-12-28 00:54:14'),(192,133,2,'1974-08-22 12:37:32','1974-09-12 12:37:32','1974-08-22 12:37:32','2020-12-28 00:54:14'),(195,128,3,'1985-07-13 07:19:33','1985-08-03 07:19:33','1985-07-13 07:19:33','2020-12-28 00:54:14'),(195,159,2,'1972-02-27 14:49:04','1972-03-19 14:49:04','1972-02-27 14:49:04','2020-12-28 00:54:14'),(195,184,2,'2015-12-28 09:29:55','2016-01-18 09:29:55','2015-12-28 09:29:55','2020-12-28 00:54:14'),(197,108,2,'1974-10-02 02:33:27','1974-10-23 02:33:27','1974-10-02 02:33:27','2020-12-28 00:54:14'),(199,118,1,'1983-04-10 22:02:22','1983-05-01 22:02:22','1983-04-10 22:02:22','2020-12-28 00:54:14'),(199,127,1,'1973-03-29 03:58:16','1973-04-19 03:58:16','1973-03-29 03:58:16','2020-12-28 00:54:14'),(199,159,2,'2005-12-21 03:54:32','2006-01-11 03:54:32','2005-12-21 03:54:32','2020-12-28 00:54:14'),(200,183,1,'1984-02-29 17:31:57','1984-03-21 17:31:57','1984-02-29 17:31:57','2020-12-28 00:54:14');
/*!40000 ALTER TABLE `friendship` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `friendship_statuses`
--

DROP TABLE IF EXISTS `friendship_statuses`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `friendship_statuses` (
  `id` bigint unsigned NOT NULL AUTO_INCREMENT COMMENT 'Р�РґРµРЅС‚РёС„РёРєР°С‚РѕСЂ СЃС‚СЂРѕРєРё',
  `name` varchar(150) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL COMMENT 'РќР°Р·РІР°РЅРёРµ СЃС‚Р°С‚СѓСЃР°',
  `created_at` datetime DEFAULT CURRENT_TIMESTAMP COMMENT 'Р’СЂРµРјСЏ СЃРѕР·РґР°РЅРёСЏ СЃС‚СЂРѕРєРё',
  `updated_at` datetime DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP COMMENT 'Р’СЂРµРјСЏ РѕР±РЅРѕРІР»РµРЅРёСЏ СЃС‚СЂРѕРєРё',
  PRIMARY KEY (`id`),
  UNIQUE KEY `name` (`name`)
) ENGINE=InnoDB AUTO_INCREMENT=4 DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci COMMENT='РЎС‚Р°С‚СѓСЃС‹ РґСЂСѓР¶Р±С‹';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `friendship_statuses`
--

LOCK TABLES `friendship_statuses` WRITE;
/*!40000 ALTER TABLE `friendship_statuses` DISABLE KEYS */;
INSERT INTO `friendship_statuses` VALUES (1,'Requested','2020-12-28 00:10:17','2020-12-28 00:10:17'),(2,'Approved','2020-12-28 00:10:17','2020-12-28 00:10:17'),(3,'Declined','2020-12-28 00:10:17','2020-12-28 00:10:17');
/*!40000 ALTER TABLE `friendship_statuses` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `gender`
--

DROP TABLE IF EXISTS `gender`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `gender` (
  `id` int unsigned NOT NULL AUTO_INCREMENT COMMENT 'Идентификатор строки',
  `gender` varchar(25) DEFAULT NULL COMMENT 'Название пола',
  `gender_info` varchar(150) DEFAULT NULL COMMENT 'Информация о поле',
  `active` tinyint(1) DEFAULT NULL COMMENT 'Активен/Неактивен. Доступность для выбора',
  `created_at` datetime DEFAULT CURRENT_TIMESTAMP COMMENT 'Время создания строки',
  `updated_at` datetime DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP COMMENT 'Время обновления строки',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=3 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci COMMENT='Варианты полов';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `gender`
--

LOCK TABLES `gender` WRITE;
/*!40000 ALTER TABLE `gender` DISABLE KEYS */;
INSERT INTO `gender` VALUES (1,'M','Мужской',NULL,'2020-12-27 23:52:57','2020-12-27 23:52:57'),(2,'F','Женский',NULL,'2020-12-27 23:52:57','2020-12-27 23:52:57');
/*!40000 ALTER TABLE `gender` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `media`
--

DROP TABLE IF EXISTS `media`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `media` (
  `id` bigint unsigned NOT NULL AUTO_INCREMENT COMMENT 'Р�РґРµРЅС‚РёС„РёРєР°С‚РѕСЂ СЃС‚СЂРѕРєРё',
  `user_id` int unsigned NOT NULL COMMENT 'РЎСЃС‹Р»РєР° РЅР° РїРѕР»СЊР·РѕРІР°С‚РµР»СЏ, РєРѕС‚РѕСЂС‹Р№ Р·Р°РіСЂСѓР·РёР» С„Р°Р№Р»',
  `filename` varchar(255) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL COMMENT 'РџСѓС‚СЊ Рє С„Р°Р№Р»Сѓ',
  `size` int NOT NULL COMMENT 'Р Р°Р·РјРµСЂ С„Р°Р№Р»Р°',
  `metadata` json DEFAULT NULL,
  `media_type_id` int unsigned NOT NULL COMMENT 'РЎСЃС‹Р»РєР° РЅР° С‚РёРї РєРѕРЅС‚РµРЅС‚Р°',
  `created_at` datetime DEFAULT CURRENT_TIMESTAMP COMMENT 'Р’СЂРµРјСЏ СЃРѕР·РґР°РЅРёСЏ СЃС‚СЂРѕРєРё',
  `updated_at` datetime DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP COMMENT 'Р’СЂРµРјСЏ РѕР±РЅРѕРІР»РµРЅРёСЏ СЃС‚СЂРѕРєРё',
  PRIMARY KEY (`id`),
  CONSTRAINT `media_chk_1` CHECK (json_valid(`metadata`))
) ENGINE=InnoDB AUTO_INCREMENT=51 DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci COMMENT='РњРµРґРёР°С„Р°Р№Р»С‹';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `media`
--

LOCK TABLES `media` WRITE;
/*!40000 ALTER TABLE `media` DISABLE KEYS */;
INSERT INTO `media` VALUES (1,101,'illo',6764029,'{\"size\": 6764029, \"user_id\": 101, \"filename\": \"illo\", \"media_type_id\": 3}',3,'1975-01-30 01:14:17','1976-01-30 01:14:17'),(2,102,'iure',3941419,'{\"size\": 3941419, \"user_id\": 102, \"filename\": \"iure\", \"media_type_id\": 3}',3,'1988-03-23 11:51:04','1989-03-23 11:51:04'),(3,104,'qui',81970746,'{\"size\": 81970746, \"user_id\": 104, \"filename\": \"qui\", \"media_type_id\": 1}',1,'2007-08-24 08:59:11','2008-08-24 08:59:11'),(4,105,'molestias',73487156,'{\"size\": 73487156, \"user_id\": 105, \"filename\": \"molestias\", \"media_type_id\": 2}',2,'2006-03-24 05:22:17','2007-03-24 05:22:17'),(5,106,'voluptatem',4255284,'{\"size\": 4255284, \"user_id\": 106, \"filename\": \"voluptatem\", \"media_type_id\": 2}',2,'1970-06-03 05:45:01','1971-06-03 05:45:01'),(6,107,'quas',984331,'{\"size\": 984331, \"user_id\": 107, \"filename\": \"quas\", \"media_type_id\": 2}',2,'1977-08-04 02:36:59','1978-08-04 02:36:59'),(7,108,'facere',2164121,'{\"size\": 2164121, \"user_id\": 108, \"filename\": \"facere\", \"media_type_id\": 1}',1,'1983-12-24 01:05:44','1984-12-24 01:05:44'),(8,109,'nam',117685,'{\"size\": 117685, \"user_id\": 109, \"filename\": \"nam\", \"media_type_id\": 2}',2,'1985-07-02 11:02:48','1986-07-02 11:02:48'),(9,110,'omnis',7826030,'{\"size\": 7826030, \"user_id\": 110, \"filename\": \"omnis\", \"media_type_id\": 2}',2,'2002-08-05 17:15:23','2003-08-05 17:15:23'),(10,111,'dolore',32801,'{\"size\": 32801, \"user_id\": 111, \"filename\": \"dolore\", \"media_type_id\": 1}',1,'2009-03-29 09:28:02','2010-03-29 09:28:02'),(11,113,'perspiciatis',51161902,'{\"size\": 51161902, \"user_id\": 113, \"filename\": \"perspiciatis\", \"media_type_id\": 3}',3,'1999-09-21 03:27:53','2000-09-21 03:27:53'),(12,116,'quos',2662743,'{\"size\": 2662743, \"user_id\": 116, \"filename\": \"quos\", \"media_type_id\": 3}',3,'2008-06-14 19:17:40','2009-06-14 19:17:40'),(13,117,'et',9836285,'{\"size\": 9836285, \"user_id\": 117, \"filename\": \"et\", \"media_type_id\": 1}',1,'1980-06-20 18:47:52','1981-06-20 18:47:52'),(14,118,'aliquid',1189574,'{\"size\": 1189574, \"user_id\": 118, \"filename\": \"aliquid\", \"media_type_id\": 1}',1,'2007-11-27 02:55:10','2008-11-27 02:55:10'),(15,119,'alias',8164299,'{\"size\": 8164299, \"user_id\": 119, \"filename\": \"alias\", \"media_type_id\": 2}',2,'2016-02-17 11:49:02','2017-02-17 11:49:02'),(16,120,'dicta',504524,'{\"size\": 504524, \"user_id\": 120, \"filename\": \"dicta\", \"media_type_id\": 3}',3,'1978-06-16 01:51:04','1979-06-16 01:51:04'),(17,121,'quis',13955665,'{\"size\": 13955665, \"user_id\": 121, \"filename\": \"quis\", \"media_type_id\": 3}',3,'1973-06-02 02:01:43','1974-06-02 02:01:43'),(18,123,'ipsam',6442209,'{\"size\": 6442209, \"user_id\": 123, \"filename\": \"ipsam\", \"media_type_id\": 1}',1,'2012-03-16 16:48:36','2013-03-16 16:48:36'),(19,124,'iure',81771,'{\"size\": 81771, \"user_id\": 124, \"filename\": \"iure\", \"media_type_id\": 1}',1,'1983-03-27 03:08:48','1984-03-27 03:08:48'),(20,126,'eum',8637375,'{\"size\": 8637375, \"user_id\": 126, \"filename\": \"eum\", \"media_type_id\": 2}',2,'2020-09-25 11:06:04','2021-09-25 11:06:04'),(21,127,'doloremque',9287599,'{\"size\": 9287599, \"user_id\": 127, \"filename\": \"doloremque\", \"media_type_id\": 2}',2,'1990-09-22 07:39:45','1991-09-22 07:39:45'),(22,128,'id',3863634,'{\"size\": 3863634, \"user_id\": 128, \"filename\": \"id\", \"media_type_id\": 1}',1,'2010-07-12 21:30:19','2011-07-12 21:30:19'),(23,129,'eveniet',37390622,'{\"size\": 37390622, \"user_id\": 129, \"filename\": \"eveniet\", \"media_type_id\": 1}',1,'2018-08-06 14:30:25','2019-08-06 14:30:25'),(24,133,'saepe',8240478,'{\"size\": 8240478, \"user_id\": 133, \"filename\": \"saepe\", \"media_type_id\": 2}',2,'2003-03-17 02:54:07','2004-03-17 02:54:07'),(25,134,'culpa',3403966,'{\"size\": 3403966, \"user_id\": 134, \"filename\": \"culpa\", \"media_type_id\": 2}',2,'1992-04-23 10:18:44','1993-04-23 10:18:44'),(26,135,'officia',387648,'{\"size\": 387648, \"user_id\": 135, \"filename\": \"officia\", \"media_type_id\": 2}',2,'2002-12-05 17:17:30','2003-12-05 17:17:30'),(27,136,'ipsam',46904,'{\"size\": 46904, \"user_id\": 136, \"filename\": \"ipsam\", \"media_type_id\": 2}',2,'1970-10-20 07:49:30','1971-10-20 07:49:30'),(28,137,'sunt',5435344,'{\"size\": 5435344, \"user_id\": 137, \"filename\": \"sunt\", \"media_type_id\": 1}',1,'1999-12-23 18:54:59','2000-12-23 18:54:59'),(29,141,'eum',6945545,'{\"size\": 6945545, \"user_id\": 141, \"filename\": \"eum\", \"media_type_id\": 3}',3,'2004-06-07 00:58:23','2005-06-07 00:58:23'),(30,143,'commodi',7089256,'{\"size\": 7089256, \"user_id\": 143, \"filename\": \"commodi\", \"media_type_id\": 1}',1,'2014-11-13 05:53:04','2015-11-13 05:53:04'),(31,152,'non',8403859,'{\"size\": 8403859, \"user_id\": 152, \"filename\": \"non\", \"media_type_id\": 3}',3,'1989-11-22 03:50:30','1990-11-22 03:50:30'),(32,156,'modi',1202792,'{\"size\": 1202792, \"user_id\": 156, \"filename\": \"modi\", \"media_type_id\": 3}',3,'2014-03-24 22:09:10','2015-03-24 22:09:10'),(33,157,'aut',3212277,'{\"size\": 3212277, \"user_id\": 157, \"filename\": \"aut\", \"media_type_id\": 3}',3,'1996-04-02 23:08:09','1997-04-02 23:08:09'),(34,158,'molestiae',8205137,'{\"size\": 8205137, \"user_id\": 158, \"filename\": \"molestiae\", \"media_type_id\": 3}',3,'1970-06-17 19:43:58','1971-06-17 19:43:58'),(35,159,'vel',802003,'{\"size\": 802003, \"user_id\": 159, \"filename\": \"vel\", \"media_type_id\": 3}',3,'1998-01-26 12:10:43','1999-01-26 12:10:43'),(36,160,'asperiores',55025,'{\"size\": 55025, \"user_id\": 160, \"filename\": \"asperiores\", \"media_type_id\": 2}',2,'1998-04-06 01:34:14','1999-04-06 01:34:14'),(37,161,'est',143608,'{\"size\": 143608, \"user_id\": 161, \"filename\": \"est\", \"media_type_id\": 1}',1,'2014-10-22 06:26:59','2015-10-22 06:26:59'),(38,164,'numquam',401859,'{\"size\": 401859, \"user_id\": 164, \"filename\": \"numquam\", \"media_type_id\": 2}',2,'2005-12-16 01:26:53','2006-12-16 01:26:53'),(39,165,'doloribus',9603382,'{\"size\": 9603382, \"user_id\": 165, \"filename\": \"doloribus\", \"media_type_id\": 2}',2,'2001-12-17 12:28:45','2002-12-17 12:28:45'),(40,166,'aliquid',6810913,'{\"size\": 6810913, \"user_id\": 166, \"filename\": \"aliquid\", \"media_type_id\": 1}',1,'1976-08-25 08:02:34','1977-08-25 08:02:34'),(41,169,'aliquam',5244586,'{\"size\": 5244586, \"user_id\": 169, \"filename\": \"aliquam\", \"media_type_id\": 2}',2,'1982-07-12 23:30:28','1983-07-12 23:30:28'),(42,170,'eaque',5789910,'{\"size\": 5789910, \"user_id\": 170, \"filename\": \"eaque\", \"media_type_id\": 1}',1,'1975-12-13 11:13:06','1976-12-13 11:13:06'),(43,171,'quia',3219411,'{\"size\": 3219411, \"user_id\": 171, \"filename\": \"quia\", \"media_type_id\": 2}',2,'1978-05-11 02:25:01','1979-05-11 02:25:01'),(44,172,'suscipit',8709186,'{\"size\": 8709186, \"user_id\": 172, \"filename\": \"suscipit\", \"media_type_id\": 3}',3,'1991-11-28 06:32:31','1992-11-28 06:32:31'),(45,177,'in',663452,'{\"size\": 663452, \"user_id\": 177, \"filename\": \"in\", \"media_type_id\": 2}',2,'2009-02-14 03:02:19','2010-02-14 03:02:19'),(46,178,'voluptatum',7868678,'{\"size\": 7868678, \"user_id\": 178, \"filename\": \"voluptatum\", \"media_type_id\": 2}',2,'1997-01-27 12:02:38','1998-01-27 12:02:38'),(47,181,'beatae',3904411,'{\"size\": 3904411, \"user_id\": 181, \"filename\": \"beatae\", \"media_type_id\": 1}',1,'2013-11-03 18:40:13','2014-11-03 18:40:13'),(48,182,'architecto',83321120,'{\"size\": 83321120, \"user_id\": 182, \"filename\": \"architecto\", \"media_type_id\": 3}',3,'2004-03-16 00:32:53','2005-03-16 00:32:53'),(49,183,'illo',3364830,'{\"size\": 3364830, \"user_id\": 183, \"filename\": \"illo\", \"media_type_id\": 2}',2,'2007-06-27 03:26:31','2008-06-27 03:26:31'),(50,184,'nobis',245588,'{\"size\": 245588, \"user_id\": 184, \"filename\": \"nobis\", \"media_type_id\": 2}',2,'1989-01-08 18:16:22','1990-01-08 18:16:22');
/*!40000 ALTER TABLE `media` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `media_types`
--

DROP TABLE IF EXISTS `media_types`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `media_types` (
  `id` bigint unsigned NOT NULL AUTO_INCREMENT COMMENT 'Р�РґРµРЅС‚РёС„РёРєР°С‚РѕСЂ СЃС‚СЂРѕРєРё',
  `name` varchar(255) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL COMMENT 'РќР°Р·РІР°РЅРёРµ С‚РёРїР°',
  `created_at` datetime DEFAULT CURRENT_TIMESTAMP COMMENT 'Р’СЂРµРјСЏ СЃРѕР·РґР°РЅРёСЏ СЃС‚СЂРѕРєРё',
  `updated_at` datetime DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP COMMENT 'Р’СЂРµРјСЏ РѕР±РЅРѕРІР»РµРЅРёСЏ СЃС‚СЂРѕРєРё',
  PRIMARY KEY (`id`),
  UNIQUE KEY `name` (`name`)
) ENGINE=InnoDB AUTO_INCREMENT=4 DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci COMMENT='РўРёРїС‹ РјРµРґРёР°С„Р°Р№Р»РѕРІ';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `media_types`
--

LOCK TABLES `media_types` WRITE;
/*!40000 ALTER TABLE `media_types` DISABLE KEYS */;
INSERT INTO `media_types` VALUES (1,'Video','2020-12-28 00:04:52','2020-12-28 00:04:52'),(2,'Audio','2020-12-28 00:04:52','2020-12-28 00:04:52'),(3,'Image','2020-12-28 00:04:52','2020-12-28 00:04:52');
/*!40000 ALTER TABLE `media_types` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `messages`
--

DROP TABLE IF EXISTS `messages`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `messages` (
  `id` bigint unsigned NOT NULL AUTO_INCREMENT COMMENT 'Р�РґРµРЅС‚РёС„РёРєР°С‚РѕСЂ СЃС‚СЂРѕРєРё',
  `from_user_id` int unsigned NOT NULL COMMENT 'РЎСЃС‹Р»РєР° РЅР° РѕС‚РїСЂР°РІРёС‚РµР»СЏ СЃРѕРѕР±С‰РµРЅРёСЏ',
  `to_user_id` int unsigned NOT NULL COMMENT 'РЎСЃС‹Р»РєР° РЅР° РїРѕР»СѓС‡Р°С‚РµР»СЏ СЃРѕРѕР±С‰РµРЅРёСЏ',
  `body` text CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL COMMENT 'РўРµРєСЃС‚ СЃРѕРѕР±С‰РµРЅРёСЏ',
  `is_important` tinyint(1) DEFAULT NULL COMMENT 'РџСЂРёР·РЅР°Рє РІР°Р¶РЅРѕСЃС‚Рё',
  `is_delivered` tinyint(1) DEFAULT NULL COMMENT 'РџСЂРёР·РЅР°Рє РґРѕСЃС‚Р°РІРєРё',
  `is_read` tinyint(1) DEFAULT NULL COMMENT 'РџСЂРёР·РЅР°Рє, С‡С‚Рѕ СЃРѕРѕР±С‰РµРЅ РїСЂРѕС‡С‚РµРЅРёСЏ',
  `created_at` datetime DEFAULT CURRENT_TIMESTAMP COMMENT 'Р’СЂРµРјСЏ СЃРѕР·РґР°РЅРёСЏ СЃС‚СЂРѕРєРё',
  `updated_at` datetime DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP COMMENT 'Р’СЂРµРјСЏ РѕР±РЅРѕРІР»РµРЅРёСЏ СЃС‚СЂРѕРєРё',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=101 DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci COMMENT='РЎРѕРѕР±С‰РµРЅРёСЏ';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `messages`
--

LOCK TABLES `messages` WRITE;
/*!40000 ALTER TABLE `messages` DISABLE KEYS */;
INSERT INTO `messages` VALUES (1,73,98,'vel',1,0,0,'2000-06-29 03:21:26','2000-07-06 03:21:26'),(2,72,63,'temporibus',0,1,0,'1973-01-22 08:31:35','1973-01-29 08:31:35'),(3,2,17,'nesciunt',0,1,1,'1970-10-04 21:11:13','1970-10-11 21:11:13'),(4,81,54,'quos',0,1,0,'1978-03-31 18:46:52','1978-04-07 18:46:52'),(5,25,65,'inventore',1,1,1,'1979-03-08 12:58:06','1979-03-15 12:58:06'),(6,48,44,'distinctio',0,1,0,'1995-04-19 13:50:07','1995-04-26 13:50:07'),(7,77,51,'hic',0,0,1,'1970-11-18 02:02:55','1970-11-25 02:02:55'),(8,23,63,'earum',1,1,0,'2005-11-12 00:48:35','2005-11-19 00:48:35'),(9,43,29,'neque',0,1,1,'1970-08-25 23:33:08','1970-09-01 23:33:08'),(10,13,80,'rem',1,0,1,'1992-02-21 09:18:07','1992-02-28 09:18:07'),(11,60,60,'ut',0,0,0,'2014-06-23 17:47:58','2014-06-30 17:47:58'),(12,17,7,'in',1,0,0,'1980-06-09 04:46:28','1980-06-16 04:46:28'),(13,84,98,'distinctio',1,0,1,'2000-11-25 07:03:23','2000-12-02 07:03:23'),(14,36,84,'nihil',0,1,1,'2010-12-22 08:05:27','2010-12-29 08:05:27'),(15,15,22,'corrupti',0,1,0,'2014-02-07 02:39:04','2014-02-14 02:39:04'),(16,62,46,'quae',1,1,0,'2003-07-12 01:05:38','2003-07-19 01:05:38'),(17,42,72,'illo',0,1,1,'1998-12-27 16:21:14','1999-01-03 16:21:14'),(18,33,49,'aliquam',1,0,0,'1997-04-15 16:01:18','1997-04-22 16:01:18'),(19,45,76,'iste',1,0,0,'1976-01-13 17:17:00','1976-01-20 17:17:00'),(20,46,2,'qui',1,1,0,'1982-04-25 03:48:53','1982-05-02 03:48:53'),(21,72,53,'nihil',0,1,0,'1995-08-06 12:59:36','1995-08-13 12:59:36'),(22,49,84,'omnis',1,1,1,'1991-06-09 18:25:46','1991-06-16 18:25:46'),(23,74,18,'dolore',1,1,0,'2016-11-28 10:01:53','2016-12-05 10:01:53'),(24,66,77,'nobis',1,1,0,'1985-06-13 06:22:25','1985-06-20 06:22:25'),(25,84,89,'tenetur',1,0,1,'1986-08-07 07:43:17','1986-08-14 07:43:17'),(26,92,92,'nostrum',0,0,1,'1999-04-05 04:34:31','1999-04-12 04:34:31'),(27,86,52,'est',0,0,1,'2000-03-09 13:31:10','2000-03-16 13:31:10'),(28,4,60,'placeat',0,0,1,'1995-03-09 05:56:41','1995-03-16 05:56:41'),(29,89,63,'labore',1,1,1,'2005-05-21 22:31:31','2005-05-28 22:31:31'),(30,50,61,'consequatur',0,0,0,'1976-05-13 12:50:03','1976-05-20 12:50:03'),(31,53,81,'ab',1,0,0,'2006-01-01 14:37:46','2006-01-08 14:37:46'),(32,44,79,'enim',1,1,0,'2014-11-25 06:45:29','2014-12-02 06:45:29'),(33,60,64,'dignissimos',0,0,1,'1988-06-22 14:34:29','1988-06-29 14:34:29'),(34,41,12,'possimus',0,0,0,'2008-09-18 14:18:33','2008-09-25 14:18:33'),(35,37,46,'omnis',1,1,1,'1976-08-11 12:34:29','1976-08-18 12:34:29'),(36,21,66,'quos',1,1,1,'2006-05-28 23:48:33','2006-06-04 23:48:33'),(37,68,41,'numquam',1,0,1,'1989-03-10 05:12:28','1989-03-17 05:12:28'),(38,2,84,'cum',1,0,0,'1980-08-06 12:32:10','1980-08-13 12:32:10'),(39,14,18,'non',1,0,0,'1989-04-04 15:13:02','1989-04-11 15:13:02'),(40,49,88,'ut',1,0,0,'1985-05-25 00:50:08','1985-06-01 00:50:08'),(41,94,5,'omnis',0,1,1,'2013-12-05 05:19:27','2013-12-12 05:19:27'),(42,41,89,'voluptatem',0,0,0,'1986-05-26 17:36:08','1986-06-02 17:36:08'),(43,21,37,'ea',0,0,1,'1995-12-05 10:56:21','1995-12-12 10:56:21'),(44,24,9,'molestiae',0,1,1,'2008-01-09 08:00:25','2008-01-16 08:00:25'),(45,70,23,'eius',1,1,0,'1971-07-20 13:30:23','1971-07-27 13:30:23'),(46,5,55,'non',0,0,0,'1996-08-14 11:13:28','1996-08-21 11:13:28'),(47,58,25,'voluptatem',1,0,1,'1985-01-03 22:27:07','1985-01-10 22:27:07'),(48,49,71,'beatae',1,0,1,'2002-03-28 15:06:20','2002-04-04 15:06:20'),(49,7,22,'delectus',0,0,1,'2001-01-23 21:22:33','2001-01-30 21:22:33'),(50,87,67,'optio',0,1,0,'1990-12-25 09:34:46','1991-01-01 09:34:46'),(51,77,82,'nemo',0,1,1,'2007-08-31 05:44:14','2007-09-07 05:44:14'),(52,80,54,'doloremque',1,1,1,'1989-06-07 05:55:22','1989-06-14 05:55:22'),(53,29,84,'rem',0,0,0,'1988-07-26 09:28:35','1988-08-02 09:28:35'),(54,29,95,'consequuntur',1,1,1,'2003-05-15 06:32:39','2003-05-22 06:32:39'),(55,85,40,'sed',0,0,0,'1984-11-05 21:22:57','1984-11-12 21:22:57'),(56,46,7,'minima',0,0,0,'1971-09-15 00:41:45','1971-09-22 00:41:45'),(57,98,69,'quam',1,1,1,'1972-05-26 17:51:59','1972-06-02 17:51:59'),(58,49,40,'repellendus',1,1,1,'1998-12-10 17:38:24','1998-12-17 17:38:24'),(59,51,33,'in',1,1,1,'2009-08-14 09:20:53','2009-08-21 09:20:53'),(60,13,65,'eum',0,1,1,'1994-03-21 10:15:53','1994-03-28 10:15:53'),(61,87,39,'distinctio',1,1,1,'2017-03-06 18:22:14','2017-03-13 18:22:14'),(62,31,40,'officia',1,1,0,'1973-04-25 22:28:12','1973-05-02 22:28:12'),(63,5,5,'consequatur',1,1,0,'2008-02-07 20:10:30','2008-02-14 20:10:30'),(64,8,27,'totam',1,0,1,'1988-06-09 00:08:01','1988-06-16 00:08:01'),(65,11,72,'explicabo',1,0,1,'1972-02-16 15:51:38','1972-02-23 15:51:38'),(66,25,11,'voluptatibus',1,0,0,'1979-11-21 05:21:20','1979-11-28 05:21:20'),(67,79,60,'occaecati',1,0,1,'1993-04-20 22:47:08','1993-04-27 22:47:08'),(68,62,30,'enim',0,1,1,'1978-03-07 08:49:29','1978-03-14 08:49:29'),(69,62,21,'iste',1,0,0,'2016-03-25 04:57:34','2016-04-01 04:57:34'),(70,18,26,'et',0,1,1,'2020-11-14 01:05:09','2020-11-21 01:05:09'),(71,77,5,'labore',0,1,0,'2004-08-17 04:36:36','2004-08-24 04:36:36'),(72,93,52,'et',0,0,1,'1985-04-14 10:39:33','1985-04-21 10:39:33'),(73,81,46,'harum',1,1,1,'2016-03-11 01:42:24','2016-03-18 01:42:24'),(74,89,6,'fuga',1,0,0,'1972-02-08 13:01:47','1972-02-15 13:01:47'),(75,61,89,'ut',0,1,1,'1979-06-11 23:22:43','1979-06-18 23:22:43'),(76,59,28,'odio',1,1,0,'1994-07-31 06:38:35','1994-08-07 06:38:35'),(77,63,30,'sint',1,0,1,'1977-05-07 05:39:16','1977-05-14 05:39:16'),(78,62,17,'consequuntur',0,0,0,'1986-08-18 03:19:55','1986-08-25 03:19:55'),(79,1,53,'molestiae',0,0,0,'2000-05-22 06:27:21','2000-05-29 06:27:21'),(80,60,40,'veritatis',1,0,0,'2016-10-01 19:38:26','2016-10-08 19:38:26'),(81,20,82,'veniam',1,1,0,'1983-01-19 06:26:04','1983-01-26 06:26:04'),(82,46,86,'nulla',1,0,0,'1999-03-19 15:56:29','1999-03-26 15:56:29'),(83,89,87,'harum',0,0,1,'1978-12-28 15:08:06','1979-01-04 15:08:06'),(84,69,82,'quibusdam',0,1,0,'2019-03-30 11:13:36','2019-04-06 11:13:36'),(85,2,64,'et',1,0,0,'2005-11-21 11:34:07','2005-11-28 11:34:07'),(86,14,77,'et',1,1,0,'1992-10-22 10:04:54','1992-10-29 10:04:54'),(87,44,86,'fuga',1,1,0,'1988-07-17 14:11:46','1988-07-24 14:11:46'),(88,97,26,'nam',1,1,1,'1999-07-05 16:24:42','1999-07-12 16:24:42'),(89,38,13,'dolor',0,0,1,'1980-11-23 21:34:33','1980-11-30 21:34:33'),(90,51,13,'maiores',1,1,1,'2006-03-07 10:38:29','2006-03-14 10:38:29'),(91,14,28,'quis',1,1,1,'1996-06-28 08:19:12','1996-07-05 08:19:12'),(92,97,2,'nam',0,0,1,'2020-10-02 03:59:24','2020-10-09 03:59:24'),(93,16,77,'aut',1,1,1,'2007-07-03 09:47:40','2007-07-10 09:47:40'),(94,36,48,'quod',0,1,1,'2012-11-28 23:32:52','2012-12-05 23:32:52'),(95,30,6,'adipisci',0,0,1,'2003-08-28 15:17:50','2003-09-04 15:17:50'),(96,38,74,'dolorum',0,1,1,'1991-04-05 22:56:18','1991-04-12 22:56:18'),(97,55,51,'enim',0,0,1,'1974-07-23 07:22:13','1974-07-30 07:22:13'),(98,91,1,'impedit',0,1,1,'1974-01-09 09:52:41','1974-01-16 09:52:41'),(99,32,55,'nulla',1,1,1,'1989-10-14 02:36:46','1989-10-21 02:36:46'),(100,78,26,'ea',0,1,0,'2004-12-14 17:02:54','2004-12-21 17:02:54');
/*!40000 ALTER TABLE `messages` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `profiles`
--

DROP TABLE IF EXISTS `profiles`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `profiles` (
  `user_id` int unsigned NOT NULL COMMENT 'РЎСЃС‹Р»РєР° РЅР° РїРѕР»СЊР·РѕРІР°С‚РµР»СЏ',
  `gender_id` int NOT NULL COMMENT 'Ссылка на пол',
  `birthday` date DEFAULT NULL COMMENT 'Р”Р°С‚Р° СЂРѕР¶РґРµРЅРёСЏ',
  `photo_id` int unsigned DEFAULT NULL COMMENT 'РЎСЃС‹Р»РєР° РЅР° РѕСЃРЅРѕРІРЅСѓСЋ С„РѕС‚РѕРіСЂР°С„РёСЋ РїРѕР»СЊР·РѕРІР°С‚РµР»СЏ, id Р±РµСЂРµС‚СЃСЏ РёР· С‚Р°Р±Р»РёС†С‹ media',
  `user_status_id` int unsigned DEFAULT NULL,
  `city` varchar(130) CHARACTER SET utf8 COLLATE utf8_unicode_ci DEFAULT NULL COMMENT 'Р“РѕСЂРѕРґ РїСЂРѕР¶РёРІР°РЅРёСЏ',
  `country` varchar(130) CHARACTER SET utf8 COLLATE utf8_unicode_ci DEFAULT NULL COMMENT 'РЎС‚СЂР°РЅР° РїСЂРѕР¶РёРІР°РЅРёСЏ',
  `first_name` varchar(100) COLLATE utf8_unicode_ci NOT NULL COMMENT 'Имя пользователя',
  `last_name` varchar(100) COLLATE utf8_unicode_ci NOT NULL COMMENT 'Фамилия пользователя',
  `created_at` datetime DEFAULT CURRENT_TIMESTAMP COMMENT 'Р’СЂРµРјСЏ СЃРѕР·РґР°РЅРёСЏ СЃС‚СЂРѕРєРё',
  `updated_at` datetime DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP COMMENT 'Р’СЂРµРјСЏ РѕР±РЅРѕРІР»РµРЅРёСЏ СЃС‚СЂРѕРєРё',
  PRIMARY KEY (`user_id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci COMMENT='РџСЂРѕС„РёР»Рё';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `profiles`
--

LOCK TABLES `profiles` WRITE;
/*!40000 ALTER TABLE `profiles` DISABLE KEYS */;
INSERT INTO `profiles` VALUES (101,1,'2008-03-26',16,2,'Wymanfurt','Kentucky','Shanon','Vandervort','2014-01-04 16:43:58','2014-04-05 16:43:58'),(102,2,'1992-10-11',34,2,'West Cordeliachester','Massachusetts','Brycen','Hickle','1986-04-29 18:36:41','1986-07-29 18:36:41'),(104,1,'1988-10-14',35,1,'East Brittanyhaven','RhodeIsland','Lafayette','Mraz','2009-02-14 06:19:09','2009-05-16 06:19:09'),(105,1,'1984-09-24',32,1,'West Romanbury','Nebraska','Joesph','Bauch','1971-09-03 00:33:30','1971-12-03 00:33:30'),(106,1,'2001-02-04',33,2,'Leannfurt','Montana','Adelle','Gibson','1995-01-20 01:29:27','1995-04-21 01:29:27'),(107,1,'1984-09-30',1,1,'Gorczanystad','Vermont','Ignatius','Swift','2003-08-06 17:34:37','2003-11-05 17:34:37'),(108,2,'1987-01-28',1,1,'Lake Hollisport','Vermont','Jayde','Dickens','2012-02-16 10:44:18','2012-05-17 10:44:18'),(109,1,'1989-02-23',2,1,'O\'Connellfort','Minnesota','Beth','Moen','1994-01-04 16:20:05','1994-04-05 16:20:05'),(110,2,'1996-09-26',29,1,'New Maximillianfort','Alabama','Agustin','Brown','1986-03-24 04:01:33','1986-06-23 04:01:33'),(111,1,'1996-06-20',12,1,'West Amiefort','Utah','Jeremie','Mayert','1992-04-13 07:54:13','1992-07-13 07:54:13'),(113,2,'1977-06-14',11,1,'Ivaburgh','Maine','Camila','Kshlerin','2008-07-05 05:19:03','2008-10-04 05:19:03'),(116,1,'1994-04-23',35,1,'West Opal','Connecticut','Joan','Volkman','2007-09-23 12:21:30','2007-12-23 12:21:30'),(117,1,'1989-01-28',35,2,'East Zacheryville','Delaware','Demetris','Upton','1981-12-29 12:58:57','1982-03-30 12:58:57'),(118,2,'2009-12-24',33,2,'Kuhlmanhaven','Vermont','Tyreek','Weissnat','1999-11-26 15:45:53','2000-02-25 15:45:53'),(119,1,'1994-06-17',31,2,'Alyssonmouth','Pennsylvania','Dock','Heidenreich','2009-03-16 03:58:15','2009-06-15 03:58:15'),(120,1,'2018-05-29',32,1,'South Bessieshire','Alaska','Garrick','O\'Hara','2007-07-16 22:07:08','2007-10-15 22:07:08'),(121,2,'1995-07-17',34,1,'Cindyshire','Kansas','Stacy','Daniel','1983-09-26 04:43:49','1983-12-26 04:43:49'),(123,1,'2001-02-11',48,2,'North Alvina','NewHampshire','Dorris','Bode','1983-12-10 00:58:02','1984-03-10 00:58:02'),(124,2,'2015-04-10',2,1,'Port Lenoratown','Colorado','Ima','Murazik','2014-05-02 03:24:06','2014-08-01 03:24:06'),(126,2,'2012-07-10',48,2,'New Kenstad','NorthDakota','Cleta','Prosacco','1974-09-28 22:01:50','1974-12-28 22:01:50'),(127,2,'1991-07-17',33,1,'Lake Emanuelside','District of Columbia','Loren','Heller','1984-07-30 01:23:44','1984-10-29 01:23:44'),(128,1,'1988-05-18',44,2,'Bernhardtown','Illinois','Fatima','Terry','2006-06-23 00:12:45','2006-09-22 00:12:45'),(129,1,'2010-07-01',35,1,'Nikkoborough','Ohio','Prince','Shields','2004-03-15 20:49:33','2004-06-14 20:49:33'),(133,1,'2011-02-09',33,2,'East Khalid','Montana','Catalina','Jerde','2012-08-24 18:11:28','2012-11-23 18:11:28'),(134,2,'1987-08-13',17,1,'Runteshire','Indiana','Salvatore','Beier','1979-04-07 20:28:52','1979-07-07 20:28:52'),(135,1,'1981-08-26',34,1,'Janessahaven','Alabama','Electa','Hartmann','2001-07-22 10:45:14','2001-10-21 10:45:14'),(136,1,'1995-12-18',35,2,'Vernachester','Massachusetts','Thea','Hickle','1974-09-25 04:27:08','1974-12-25 04:27:08'),(137,1,'1979-01-28',17,1,'Hintzview','Illinois','Loraine','Upton','2005-10-26 01:09:00','2006-01-25 01:09:00'),(141,2,'2007-09-18',44,1,'Toyville','Oregon','Jimmy','Sawayn','1992-01-28 14:01:19','1992-04-28 14:01:19'),(143,2,'1983-06-14',35,2,'South Karianneside','Maryland','Natasha','Pagac','2003-04-18 04:55:45','2003-07-18 04:55:45'),(152,2,'1981-10-02',35,2,'Lake Vernstad','District of Columbia','Melvin','Langworth','2001-09-24 05:11:13','2001-12-24 05:11:13'),(156,2,'2010-03-19',2,2,'Port Ceceliamouth','Arizona','Nikolas','Metz','1994-02-26 16:51:40','1994-05-28 16:51:40'),(157,2,'2016-09-30',33,2,'Gislasonstad','Colorado','Elody','Bashirian','1973-09-12 05:54:56','1973-12-12 05:54:56'),(158,1,'1971-03-30',12,2,'Alexton','Arizona','Juanita','Cummings','1970-04-22 22:08:38','1970-07-22 22:08:38'),(159,2,'1996-05-07',16,1,'Annechester','Georgia','Zita','Christiansen','1981-11-12 18:55:53','1982-02-11 18:55:53'),(160,1,'1983-12-12',32,1,'Kuvalisbury','Oregon','Maximillia','Lemke','1978-01-05 09:06:06','1978-04-06 09:06:06'),(161,1,'1993-10-14',33,2,'South Vinnietown','Delaware','Mariana','Stamm','1970-05-27 13:44:09','1970-08-26 13:44:09'),(164,2,'1974-11-16',12,2,'South Kathryne','SouthCarolina','Thad','Keebler','2014-01-09 04:30:43','2014-04-10 04:30:43'),(165,2,'1988-08-26',12,1,'South Summerland','Minnesota','Wyman','Wilderman','2015-08-12 06:57:03','2015-11-11 06:57:03'),(166,1,'2010-03-26',34,2,'Roderickport','NorthCarolina','Ramona','Schuster','1979-06-24 13:34:35','1979-09-23 13:34:35'),(169,1,'1981-05-29',12,2,'Harberport','Kentucky','Donald','Buckridge','1985-04-14 08:20:46','1985-07-14 08:20:46'),(170,1,'2014-03-16',29,2,'Juanitashire','Kansas','Noemie','Kuhic','1972-01-26 14:26:41','1972-04-26 14:26:41'),(171,1,'1976-10-23',16,1,'Port Will','Utah','Maximo','Mante','1983-02-14 04:06:49','1983-05-16 04:06:49'),(172,2,'2004-09-08',11,2,'Juliofort','Mississippi','Maximillian','Kihn','1994-08-02 16:52:17','1994-11-01 16:52:17'),(177,2,'1988-04-13',2,2,'East Kassandra','SouthDakota','Cathy','Schaden','2008-02-02 03:19:26','2008-05-03 03:19:26'),(178,1,'1982-10-09',35,2,'Kennithview','RhodeIsland','Therese','Schaefer','1988-02-10 09:00:29','1988-05-11 09:00:29'),(181,1,'2001-11-11',2,2,'Lake Dawn','Missouri','Erika','Botsford','1985-01-18 07:56:02','1985-04-19 07:56:02'),(182,2,'1995-08-19',32,1,'Port Beatriceburgh','Wyoming','Shannon','Green','1974-09-12 10:24:11','1974-12-12 10:24:11'),(183,2,'2008-07-25',12,2,'North Ansel','Illinois','Loren','Fadel','1997-12-03 08:52:47','1998-03-04 08:52:47'),(184,1,'1999-06-05',1,2,'South Giovani','Georgia','Myra','Johnson','1977-02-18 17:54:24','1977-05-20 17:54:24'),(185,1,'2016-09-16',12,1,'Calliefort','Louisiana','Rahsaan','Muller','1976-04-25 20:30:45','1976-07-25 20:30:45'),(187,2,'2008-10-13',12,1,'New Korychester','District of Columbia','Ed','Orn','1971-10-12 14:58:28','1972-01-11 14:58:28'),(192,2,'1996-09-29',17,1,'Kadebury','Delaware','Tess','Jacobi','1972-03-10 10:24:40','1972-06-09 10:24:40'),(195,1,'1975-11-29',2,1,'North Henriette','RhodeIsland','Russ','Thiel','1995-09-28 21:14:54','1995-12-28 21:14:54'),(197,2,'1984-08-28',16,1,'Satterfieldburgh','NewYork','Zoe','Osinski','2002-11-14 19:45:07','2003-02-13 19:45:07'),(199,2,'1990-02-05',35,2,'Abshirechester','NorthCarolina','Cara','Pouros','2005-11-09 10:43:16','2006-02-08 10:43:16'),(200,1,'2003-07-30',33,1,'Helenton','NorthDakota','Kaitlyn','Roob','1992-06-09 11:55:48','1992-09-08 11:55:48');
/*!40000 ALTER TABLE `profiles` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `user_statuses`
--

DROP TABLE IF EXISTS `user_statuses`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `user_statuses` (
  `id` int unsigned NOT NULL AUTO_INCREMENT COMMENT 'Идентификатор строки',
  `name` varchar(100) NOT NULL COMMENT 'Название статуса (уникально)',
  `created_at` datetime NOT NULL DEFAULT CURRENT_TIMESTAMP COMMENT 'Время создания строки',
  `updated_at` datetime DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP COMMENT 'Время обновления строки',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=3 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci COMMENT='Справочник стран';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `user_statuses`
--

LOCK TABLES `user_statuses` WRITE;
/*!40000 ALTER TABLE `user_statuses` DISABLE KEYS */;
INSERT INTO `user_statuses` VALUES (1,'single','2020-12-27 23:46:30','2020-12-27 23:46:30'),(2,'married','2020-12-27 23:46:30','2020-12-27 23:46:30');
/*!40000 ALTER TABLE `user_statuses` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `users`
--

DROP TABLE IF EXISTS `users`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `users` (
  `id` bigint unsigned NOT NULL AUTO_INCREMENT COMMENT 'Р�РґРµРЅС‚РёС„РёРєР°С‚РѕСЂ СЃС‚СЂРѕРєРё',
  `created_at` datetime DEFAULT CURRENT_TIMESTAMP COMMENT 'Р’СЂРµРјСЏ СЃРѕР·РґР°РЅРёСЏ СЃС‚СЂРѕРєРё',
  `updated_at` datetime DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP COMMENT 'Р’СЂРµРјСЏ РѕР±РЅРѕРІР»РµРЅРёСЏ СЃС‚СЂРѕРєРё',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=201 DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci COMMENT='РџРѕР»СЊР·РѕРІР°С‚РµР»Рё';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `users`
--

LOCK TABLES `users` WRITE;
/*!40000 ALTER TABLE `users` DISABLE KEYS */;
INSERT INTO `users` VALUES (101,'1974-02-03 07:08:21','1998-01-19 15:38:14'),(102,'1978-09-13 08:21:16','2020-09-12 22:58:56'),(104,'1974-07-03 18:30:15','2010-02-21 21:42:08'),(105,'1992-03-15 03:35:59','1999-07-01 00:30:19'),(106,'1999-03-06 01:36:09','1999-03-27 01:36:09'),(107,'1982-06-05 07:09:12','2020-07-09 21:54:19'),(108,'1980-09-07 17:40:59','1980-09-28 17:40:59'),(109,'1996-06-27 02:23:52','1996-07-18 02:23:52'),(110,'1998-12-10 05:54:04','2019-09-04 06:42:58'),(111,'2012-05-07 02:37:53','2012-05-28 02:37:53'),(113,'1972-07-31 01:28:22','1980-12-15 23:45:12'),(116,'1990-10-08 10:02:34','2019-07-20 08:25:10'),(117,'1977-01-01 00:11:28','1985-04-16 17:10:32'),(118,'1977-10-18 07:59:32','2001-06-08 10:39:28'),(119,'2020-01-14 14:51:11','2020-02-04 14:51:11'),(120,'1985-11-19 00:19:01','1985-12-10 00:19:01'),(121,'1987-10-24 23:50:17','1987-11-14 23:50:17'),(123,'1989-11-16 23:08:46','1989-12-07 23:08:46'),(124,'1996-06-29 15:44:26','1996-07-20 15:44:26'),(126,'1991-01-14 23:13:15','1991-02-04 23:13:15'),(127,'1977-11-15 19:22:05','2020-02-28 14:17:02'),(128,'1996-08-31 07:06:05','2012-02-17 07:20:58'),(129,'1970-06-07 13:54:02','2016-02-04 12:08:30'),(133,'1983-09-09 01:24:03','2003-12-18 22:55:45'),(134,'2006-09-07 06:54:57','2006-09-28 06:54:57'),(135,'1995-01-05 12:03:32','1997-02-05 12:58:18'),(136,'1974-11-11 09:08:48','2004-02-17 08:27:16'),(137,'2001-07-20 18:08:26','2011-07-31 12:29:20'),(141,'2017-09-08 11:34:31','2019-01-10 21:02:45'),(143,'2009-08-20 22:01:55','2020-01-10 18:11:03'),(152,'2010-10-08 00:40:06','2016-10-01 10:25:26'),(156,'2006-05-11 21:24:27','2006-06-01 21:24:27'),(157,'2012-01-05 19:52:13','2012-01-26 19:52:13'),(158,'1980-01-24 19:31:01','2010-04-12 21:34:23'),(159,'2015-05-19 03:47:24','2015-06-09 03:47:24'),(160,'2020-05-15 22:28:37','2020-06-05 22:28:37'),(161,'1991-10-21 05:33:08','1997-12-21 17:44:15'),(164,'2006-09-27 03:29:15','2006-10-18 03:29:15'),(165,'2001-11-03 21:13:58','2001-11-24 21:13:58'),(166,'2011-06-02 20:55:42','2019-01-19 08:02:29'),(169,'2016-03-26 20:23:05','2016-04-16 20:23:05'),(170,'1983-09-24 17:14:10','1990-09-24 05:21:33'),(171,'1978-10-04 02:52:27','2001-06-01 04:07:37'),(172,'2013-09-03 07:45:34','2014-07-10 12:03:35'),(177,'1995-03-10 05:56:11','2010-02-05 00:46:59'),(178,'1979-08-15 11:15:08','1998-12-02 18:47:04'),(181,'1981-04-24 15:28:27','1991-05-09 16:08:57'),(182,'1971-04-02 16:09:23','2002-07-12 00:02:27'),(183,'1975-01-26 01:30:18','2013-07-09 03:26:25'),(184,'2003-04-19 15:03:06','2003-05-10 15:03:06'),(185,'1988-04-28 20:23:12','2017-11-21 04:20:11'),(187,'1988-06-28 11:22:32','1988-07-19 11:22:32'),(192,'1983-12-13 03:12:01','1984-01-03 03:12:01'),(195,'1996-12-23 15:14:14','1997-01-13 15:14:14'),(197,'1987-11-19 22:02:47','1987-12-10 22:02:47'),(199,'1991-04-19 02:09:15','1991-05-10 02:09:15'),(200,'1973-01-02 08:17:52','1978-05-24 12:20:36');
/*!40000 ALTER TABLE `users` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2020-12-28 17:41:20
